In [1]:
# Subject: Introduction to Big Data, Analytics and Business Problem Framing
# Detail: Introduction to Python - week-02 assignment
# Date: November 14, 2017
# Prepared by Mazhar Khan

In [2]:
# In this example I am using variables, while loop, print statement and arithmetic operator to  generating table of 2 in python :)

i = 1
x = 2
while i <= 10:
    x1 = x * i
    print "%s x %d = %d" %(x, i, x1)
    i = i+1
print('The End')

2 x 1 = 2
2 x 2 = 4
2 x 3 = 6
2 x 4 = 8
2 x 5 = 10
2 x 6 = 12
2 x 7 = 14
2 x 8 = 16
2 x 9 = 18
2 x 10 = 20
The End

In [3]:
import pandas as pd

In [4]:
# Assigning the value to variable X, Y and XY
x = 10
y = 51
xy = 'Hey Big Data Class for PYTHON'

In [5]:
print x
print y
print xy

10
51
Hey Big Data Class for PYTHON

In [6]:
#Multiple variables can be assigned with the same value.
A = B = 1
print A,B

1 1

In [7]:
# variables are case sensitive
A = 5
a = 10
print A, a

5 10

In [8]:
#Symbol And Task Performed

MAZ = 20
KHA = 5

# Symble (+) Task Addition
print MAZ + KHA

# Symble (*) Task multiplication
print MAZ * KHA

# Symble (*) Task multiplication
print MAZ * KHA

# Symble (//) Task floor division
print MAZ // KHA

A = 8
B = 2
# Symble (**) Task to the power of
print A ** B

25
100
100
4
64

In [9]:
# Relational Operators

maz = 1
# Symble (==) Task True, if it is equal
print maz == 1

# Symble (!=) Task True, if not equal to
print maz != 0

# Symble (<) Task True, if less than
print maz < 0

# Symble (>) Task True, if greater than
print maz > 0

# Symble (<=) Task True, if less than or equal to
print maz <= 0

# Symble (>=) Task True, if greater than or equal to
print maz >= 0

True
True
False
True
False
True

In [10]:
# round( ) function rounds the input value to a specified number of places or to the nearest integer.

print round(64)
print round(599.76543,0)
print round(599.76543,1)
print round(599.76543,2)
print round(599.76543,3)

64.0
600.0
599.8
599.77
599.765

In [11]:
# isinstance( ) returns True, if the first argument is an instance of that class. Multiple classes can also be checked at once.

print isinstance(1, int)
print isinstance(1.0,int)
print isinstance(1.1,(int,float))

True
False
True

In [12]:
# cmp(x,y) Compare the two objects x and y and return an integer according to the outcome.

# if x<y then -1
# if x==Y then 0
# if x>y then 1

print cmp(10,20)
print cmp(20,20)
print cmp(30,20)

-1
0
1

In [13]:
# pow(x,y,z) can be used to find the power  xyxy  also the mod of the resulting value with the third specified number can be found i.e. : ( xyxy  % z).

print pow(3,2)
print pow(3,3,5)

9
2

In [14]:
# range( ) function outputs the integers of the specified range. It can also be used to generate a series by specifying the difference between the two numbers within a particular range. The elements are returned in a list (will be discussing in detail later.)

print range(2)  
print range(1,3) 
print range(2,9)
print range(2,27,8)

[0, 1]
[1, 2]
[2, 3, 4, 5, 6, 7, 8]
[2, 10, 18, 26]

In [15]:
# In Python, single, double and triple quotes are used to denote a string. Most use single quotes when declaring a single character. Double quotes when declaring a line and triple quotes when declaring a paragraph/multiple lines.

print "Hello World"
print 'Hey'
print """My name is Mazhar

this is my first Python script
I love Python."""

Hello World
Hey
My name is Mazhar

this is my first Python script
I love Python.

In [16]:
# Strings can be assigned to variable say string1 and string2 which can called when using the print statement.

string1 = 'World'
print 'Hello', string1

string2 = '!!!!!!!'
print 'Hello', string1, string2

Hello World
Hello World !!!!!!!

In [17]:
# %s is used to refer to a variable which contains a string.

print "Hello %s" % string1
print "Hello %s %s" %(string1,string2)

Hello World
Hello World !!!!!!!

In [18]:
# Similarly, when using other data types
# %s -> string
# %d -> Integer
# %f -> Float
# %o -> Octal
# %x -> Hexadecimal
# %e -> exponential
#This can be used for conversions inside the print statement itself.

m = 16

print "String Value = %s" % string1
print "Actual Number = %d" %m
print "Float of the number = %f" %m
print "Octal equivalent of the number = %o" %m
print "Hexadecimal equivalent of the number = %x" %m
print "Exponential equivalent of the number = %e" %m

String Value = World
Actual Number = 16
Float of the number = 16.000000
Octal equivalent of the number = 20
Hexadecimal equivalent of the number = 10
Exponential equivalent of the number = 1.600000e+01

In [19]:
# Print next line

print """
Routine:
\t- Eat
\t- Play
\t- Sleep\n\t- Repeat
"""

Routine:
	- Eat
	- Play
	- Sleep
	- Repeat

In [20]:
#Lists
#Lists are the most commonly used data structure. 
#Think of it as a sequence of data that is enclosed in square brackets 
#and data are separated by a comma. Each of these data can be accessed by calling it's index value.

a = []
print type(a)

<type 'list'>

In [21]:
# One can directly assign the sequence of data to a list x as shown.

x = ['apple', 'orange']
print x
print x[0]
print x[1]

['apple', 'orange']
apple
orange

In [22]:
# Indexing can also be done in reverse order. That is the last element can be accessed first. Here, indexing starts from -1. Thus index value -1 will be orange and index -2 will be apple.

x[0]

print x[-1]
print x[1]
print x[0]

orange
orange
apple

In [23]:
x = ['apple', 'orange']
y = ['carrot','potato']
z  = [x,y]
print z

[['apple', 'orange'], ['carrot', 'potato']]

In [24]:
x = ['apple', 'orange']
y = ['carrot','potato']
z  = [x,y,x]
print z

[['apple', 'orange'], ['carrot', 'potato'], ['apple', 'orange']]

In [25]:
# Slicing

In [26]:
nums = [0,1,2,3,4,5,6,7,8,9]

print nums[0:4]
print nums[4:]

# You can also slice a parent list with a fixed length or step length.

print nums[:6:2]

[0, 1, 2, 3]
[4, 5, 6, 7, 8, 9]
[0, 2, 4]

In [27]:
#Built in List Functions

#To find the length of the list or the number of elements in a list, len( ) is used.
print len(nums)

# If the list consists of all integer elements then min( ) and max( ) gives the minimum and maximum value in the list.

print max(nums)
print min(nums)

10
9
0

In [28]:
# Lists can be concatenated by adding, '+' them. The resultant list will contain all the elements of the lists that were added. The resultant list will not be a nested list.

mm = [1,2,3] + [5,4,7]

print mm

[1, 2, 3, 5, 4, 7]

In [29]:
# There might arise a requirement where you might need to check if a particular element is there in a predefined list. Consider the below list.

names = ['Earth','Wind','Fire','Water']

In [30]:
'Fire' in names

True

In [31]:
'Mazhar' in names

False

In [32]:
2 in nums

True

In [33]:
# A string can be converted into a list by using the list() function.

list('hello')

['h', 'e', 'l', 'l', 'o']

In [34]:
# append( ) is used to add a element at the end of the list.

lst = [1,1,4,8,7]

lst.append(1)
print lst

[1, 1, 4, 8, 7, 1]

In [35]:
# count( ) is used to count the number of a particular element that is present in the list.
print lst.count(1)
print lst.count(7)

3
1

In [36]:
# insert(x,y) is used to insert a element y at a specified index value x. append( ) function made it only possible to insert at the end.

lst.insert(5, 'test')
print lst

[1, 1, 4, 8, 7, 'test', 1]

In [37]:
# replacing the element 5 value

lst[5] = 'Python'
print lst

[1, 1, 4, 8, 7, 'Python', 1]

In [38]:
# remove element by specifying the element itself using the remove( ) function

lst.remove('Python')
print lst

[1, 1, 4, 8, 7, 1]

In [39]:
#Tuples

# Tuples are similar to lists but only big difference is the elements inside a list can be changed but in tuple 
# it cannot be changed. Think of tuples as something which has to be True for a particular something and cannot be 
# True for no other values.

In [40]:
xyz = divmod(30,3)
print xyz
print type(xyz)

(10, 0)
<type 'tuple'>

In [41]:
# To define a tuple, A variable is assigned to paranthesis ( ) or tuple( ).

tup = ()
tup2 = tuple()

In [42]:
# Values can be assigned while declaring a tuple. It takes a list as input and converts it into a tuple or it takes a string and converts it into a tuple.

tup3 = tuple([1,2,3])
print tup3
tup4 = tuple('Hello')
print tup4

(1, 2, 3)
('H', 'e', 'l', 'l', 'o')

In [43]:
# It follows the same indexing and slicing as Lists.

print tup3[1]
tup5 = tup4[:3]
print tup5

2
('H', 'e', 'l')

In [44]:
# Mapping one tuple to another

(a,b,c)= ('alpha','beta','gamma')
print a,b,c

alpha beta gamma

In [45]:
d = tuple('MazharKhan')
print d

('M', 'a', 'z', 'h', 'a', 'r', 'K', 'h', 'a', 'n')

In [46]:
#Sets

# Sets are mainly used to eliminate repeated numbers in a sequence/list. It is also used to perform some standard set operations.
# Sets are declared as set() which will initialize a empty set. Also set([sequence]) can be executed to declare a set with elements

In [47]:
# elements 2,3 which are repeated twice are seen only once. Thus in a set each element is distinct.

set0 = set([1,2,2,3,3,4])
print set0

set([1, 2, 3, 4])

In [48]:
set1 = set([1,2,3])
set2 = set([2,3,4,5])

# union( ) function returns a set which contains all the elements of both the sets without repition.
set1.union(set2)

{1, 2, 3, 4, 5}

In [49]:
# add( ) will add a particular element into the set. Note that the index of the newly added element is arbitrary and can be placed anywhere not neccessarily in the end.

set1.add(0)
print set1

set([0, 1, 2, 3])

In [50]:
# pop( ) is used to remove an arbitrary element in the set

set1.pop()
print set1

# remove( ) function deletes the specified element from the set.

set1.remove(2)
print set1

# clear( ) is used to clear all the elements and make that set an empty set.

set1.clear()
print set1

set([1, 2, 3])
set([1, 3])
set([])

In [51]:
# Control Flow Statements

In [52]:
x= 15

if x>12:
    print "work"

work

In [53]:
# If-else

x= 10

if x>12:
    print "work"
else:
    print "test"

test

In [54]:
# if-elif

var1 = 10
var2 = 20
if var1 > var2:
    print "var1>var2"
elif var1 < var2:
    print "var1<var2" 
else:
    print  "var1=var2"

var1<var2

In [55]:
# if statement inside a if statement or if-elif or if-else are called as nested if statements.

var1 = 10
var2 = 20
if var1 > var2:
    print "var1>var2"
elif var1 < var2:
    print "var1<var2" 
    if var1 == 10:
        print "var1=10"
    else:
        print "invalid value"
else:
    print  "var1=var2"

var1<var2
var1=10

In [56]:
## Loops

In [57]:
for i in range(5):
    print "value of i = ", i

value of i =  0
value of i =  1
value of i =  2
value of i =  3
value of i =  4

In [58]:
# Far loop with list

list_of_lists = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
for list1 in list_of_lists:
        print list1

[1, 2, 3]
[4, 5, 6]
[7, 8, 9]

In [59]:
# Far nexted loop with list

list_of_lists = [[1, 2, 3], [4, 5, 6], [7, 8, 9],['a','b','c']]
for list1 in list_of_lists:
    for xx in list1:
        print xx

1
2
3
4
5
6
7
8
9
a
b
c

In [60]:
# While

In [61]:
i = 1
while i < 5:
    print(i * 2)
    i = i+1
print('End Loop')

2
4
6
8
End Loop

In [62]:
# Break

for i in range(100):
    print i
    if i>=7:
        break

0
1
2
3
4
5
6
7

In [63]:
# Continue
for i in range(10):
    if i>4:
        print "keep looping till %d > 4" %(i)
        continue
    elif i<7:
        print i

0
1
2
3
4
keep looping till 5 > 4
keep looping till 6 > 4
keep looping till 7 > 4
keep looping till 8 > 4
keep looping till 9 > 4

In [64]:
# Preliminaries - import pandas and datetime library; create data for populating our first dataframe object
import pandas as pd
import datetime

In [65]:
# create a list containing dates from 12-01 to 12-07
dt = datetime.datetime(2017,12,1)
end = datetime.datetime(2017,12,8)
step = datetime.timedelta(days=1)
dates = []

In [66]:
# populate the list {Populating the dates variable using while loop and incrementing by step value}
while dt < end:
    dates.append(dt.strftime('%m-%d'))
    dt += step

In [67]:
d = {'Date': dates, 'Tokyo' : [15,19,15,11,9,8,13], 'Paris': [-2,0,2,5,7,-5,-3], 'Markham':[20,18,23,19,25,27,23]}

In [68]:
# Example 1: Create Dataframe Object from a Python Dictionary of equal length lists

temps = pd.DataFrame(d)
print temps

    Date  Markham  Paris  Tokyo
0  12-01       20     -2     15
1  12-02       18      0     19
2  12-03       23      2     15
3  12-04       19      5     11
4  12-05       25      7      9
5  12-06       27     -5      8
6  12-07       23     -3     13

In [69]:
ntemp = temps['Markham']
print ntemp

0    20
1    18
2    23
3    19
4    25
5    27
6    23
Name: Markham, dtype: int64

In [70]:
# Example 3 : Create DataFrame Object by reading a .csv file (Olympic Medalists)

medals=pd.read_csv('../data/olympicmedals.csv')

In [71]:
medals.tail()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
29211,Beijing,2008,Wrestling,Wrestling Gre-R,"ENGLICH, Mirko",GER,Men,84 - 96kg,M,Silver
29212,Beijing,2008,Wrestling,Wrestling Gre-R,"MIZGAITIS, Mindaugas",LTU,Men,96 - 120kg,M,Bronze
29213,Beijing,2008,Wrestling,Wrestling Gre-R,"PATRIKEEV, Yuri",ARM,Men,96 - 120kg,M,Bronze
29214,Beijing,2008,Wrestling,Wrestling Gre-R,"LOPEZ, Mijain",CUB,Men,96 - 120kg,M,Gold
29215,Beijing,2008,Wrestling,Wrestling Gre-R,"BAROEV, Khasan",RUS,Men,96 - 120kg,M,Silver

In [72]:
medals.Sport.value_counts()  # Sport Counts

Aquatics             3828
Athletics            3448
Rowing               2523
Gymnastics           2214
Fencing              1547
Football             1387
Hockey               1325
Wrestling            1140
Shooting             1105
Sailing              1061
Cycling              1025
Canoe / Kayak        1002
Basketball            940
Volleyball            910
Equestrian            894
Handball              886
Boxing                842
Weightlifting         548
Judo                  435
Baseball              335
Archery               305
Tennis                272
Rugby                 192
Softball              180
Modern Pentathlon     174
Badminton             120
Table Tennis          120
Tug of War             94
Taekwondo              80
Polo                   66
Lacrosse               59
Golf                   30
Skating                27
Ice Hockey             27
Cricket                24
Triathlon              18
Rackets                10
Croquet                 8
Water Motorsports       5
Basque Pelota           4
Roque                   3
Jeu de paume            3
Name: Sport, dtype: int64

In [73]:
medals.Medal.value_counts() # Medal Counts

Gold      9850
Bronze    9689
Silver    9677
Name: Medal, dtype: int64

In [74]:
# Getting Started with pandas

In [75]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

In [76]:
# Introduction to pandas Data Structures

obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [77]:
obj.values
obj.index  # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [78]:
print obj.values
print obj.index

[ 4  7 -5  3]
RangeIndex(start=0, stop=4, step=1)

In [79]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [80]:
print obj2
print obj2.index

d    4
b    7
a   -5
c    3
dtype: int64
Index([u'd', u'b', u'a', u'c'], dtype='object')

In [81]:
obj2['a']
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [82]:
obj2[obj2 > 0]
obj2 * 3
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [83]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [84]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [85]:
pd.isnull(obj4)
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [87]:
print pd.isnull(obj4)
print pd.notnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool
California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [88]:
print obj3 
print obj4
obj3 + obj4

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [89]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [90]:
# DataFrame

In [99]:
# DataFrame US states popu;ation by year
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [94]:
print data
print frame

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2], 'year': [2000, 2001, 2002, 2001, 2002, 2003]}
   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [95]:
frame.head()  # displaying top 5 rows

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [96]:
frame.tail() # displaying bottom 5 rows

   pop   state  year
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [97]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])  # rearange col in dataFrame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [98]:
pd.DataFrame(data, columns=['state', 'year',  'pop']) # rearange col in dataFrame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [100]:
# ading index and new col debt to state data
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
frame2
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [101]:
frame2['state']
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [104]:
# printing col state and year
print frame2['state']
print frame2.year

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object
one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [105]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [106]:
print frame2.pop

<bound method DataFrame.pop of        year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN>

In [109]:
print frame2['state']   # print col state
print frame2.loc['three'] # print row three
print frame2.loc['five'] # print row five

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object
year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object
year       2002
state    Nevada
pop         2.9
debt        NaN
Name: five, dtype: object

In [110]:
frame2['debt'] = 16.5 # populating col debt with 16.5
print frame2
frame2['debt'] = np.arange(6.) # populating col debt with seq no
print frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5
       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [111]:
# assigning debt value for row two, four and five

val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [115]:
pope = {'Nevada': {2001: 2.4, 
                   2002: 2.9},
       'Ohio': {2000: 1.5, 
                2001: 1.7, 
                2002: 3.6}}

In [116]:
# creating data Frame with pope
frame3 = pd.DataFrame(pope)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [117]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [118]:
pd.DataFrame(pope, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [119]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [120]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [121]:
frame3.columns.name = 'state'

In [122]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [123]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [124]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [125]:
# deleting two following rows from dataFrame

data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [126]:
# deleting col two

data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [127]:
# deleting columns

data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [128]:
#Indexing, Selection, and Filtering

obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
print obj
print obj['b']
print obj[1]
print obj[2:4]
print obj[['b', 'a', 'd']]
print obj[[1, 3]]
obj[obj < 2]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64
1.0
1.0
c    2.0
d    3.0
dtype: float64
b    1.0
a    0.0
d    3.0
dtype: float64
b    1.0
d    3.0
dtype: float64

a    0.0
b    1.0
dtype: float64

In [129]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
print data
print data['two']
print data[['three', 'one']]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64
          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [131]:
print data[:2]  # display firt 2 rows
print data[data['three'] > 5] # display rows where col three > 5

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [133]:
data < 5  
print data  
data[data < 5] = 0 # replace with 0 id < 5
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [134]:
# Selection with loc and iloc

print data
data.loc['Colorado', ['two', 'three']]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

two      5
three    6
Name: Colorado, dtype: int64

In [135]:
print data.iloc[2, [3, 0, 1]]
print data.iloc[2]
print data.iloc[[1, 2], [3, 0, 1]]
print data.iloc[3, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64
one       8
two       9
three    10
four     11
Name: Utah, dtype: int64
          four  one  two
Colorado     7    0    5
Utah        11    8    9
four    15
one     12
two     13
Name: New York, dtype: int64

In [136]:
#Integer Indexes

mser = pd.Series(np.arange(4.))
mser

0    0.0
1    1.0
2    2.0
3    3.0
dtype: float64

In [137]:
mser2 = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
print mser2
print "One--",mser2[0]
print "two--",mser2[1]
print "thr--",mser2[-2]
mser2[-1]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64
One-- 0.0
two-- 1.0
thr-- 2.0

3.0

In [138]:
print mser[:1]
print mser.loc[:1]
print mser.iloc[:1]

0    0.0
dtype: float64
0    0.0
1    1.0
dtype: float64
0    0.0
dtype: float64

In [ ]:
#Arithmetic and Data Alignment

In [139]:
# creating two Series


s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])
print s1
print s2

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64
a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [140]:
s1 + s2  # ading above series

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [ ]:
#Arithmetic methods with fill values

In [141]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df2.loc[1, 'b'] = np.nan
print df1
print df2

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0
      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [142]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [143]:
df1.add(df2, fill_value=0)   # missing value as zero

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [ ]:
# Sorting and Ranking

In [144]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [145]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
print frame.sort_index()
frame.sort_index(axis=1)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [146]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [147]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
print obj.sort_values() # sort by value
print obj.sort_index()  # stor by index acc

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64
0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [148]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
print frame
frame.sort_values(by='b') # sort by col "b" value

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [149]:
frame.sort_values(by=['a', 'b']) # sot by col "a" & "b"

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [151]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [152]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [153]:
# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [ ]:
# Summarizing and Computing Descriptive Statistics

In [154]:
dff = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
dff

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [155]:
dff.sum() # Sum indiv col

one    9.25
two   -5.80
dtype: float64

In [157]:
dff.sum(axis='columns') # Sum all col values

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [158]:
dff.mean(axis='columns', skipna=False) # col mean

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [159]:
dff.idxmax()

one    b
two    d
dtype: object

In [160]:
dff.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [161]:
dff.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000